{
  "system_summary": "This system provides a web interface to browse and interact with event data, which is collected from external ticketing services by a backend API.",
  "components": [
    {
      "id": "FE_WebApp",
      "label": "Frontend Web Application",
      "type": "frontend",
      "role": "Presents the user interface and interacts with the backend API to display event information.",
      "visual_3d_object": "A sleek, multi-faceted glass pane, subtly glowing, representing a web browser window.",
      "visual_label": "Floating clearly above it, a flat holographic text label reading 'FRONTEND WEB APP' in bold white sans-serif font."
    },
    {
      "id": "BE_API",
      "label": "Backend API Service",
      "type": "api",
      "role": "Manages core business logic, serves event data to the frontend, and orchestrates the collection of events from external sources.",
      "visual_3d_object": "A robust, obsidian-like cube, emanating a faint blue light, signifying a powerful API server.",
      "visual_label": "Floating clearly above it, a flat holographic text label reading 'BACKEND API' in bold white sans-serif font."
    },
    {
      "id": "DB_Events",
      "label": "Events Database",
      "type": "database",
      "role": "Persists and stores event data collected and managed by the Backend API.",
      "visual_3d_object": "A shimmering, cylindrical data store, with segments representing data layers.",
      "visual_label": "Floating clearly above it, a flat holographic text label reading 'EVENTS DATABASE' in bold white sans-serif font."
    },
    {
      "id": "External_Ticketmaster",
      "label": "External Ticketmaster API",
      "type": "external_service",
      "role": "Provides a third-party API for sourcing live event data that the system integrates with.",
      "visual_3d_object": "A translucent, swirling cloud formation, representing an external, remote service.",
      "visual_label": "Floating clearly above it, a flat holographic text label reading 'TICKETMASTER API' in bold white sans-serif font."
    }
  ],
  "connections": [
    {
      "from": "FE_WebApp",
      "to": "BE_API",
      "label": "Retrieves event data and sends user requests"
    },
    {
      "from": "BE_API",
      "to": "DB_Events",
      "label": "Reads and writes event data"
    },
    {
      "from": "BE_API",
      "to": "External_Ticketmaster",
      "label": "Collects event data"
    }
  ]
}